
<details>
<summary>游戏开发入门总结</summary>
<pre><code>
https://zhuanlan.zhihu.com/p/34114662
第一篇文章本来想直接写UE4专栏的，但是最近工作太忙，就先简单对游戏开发入门做个总结吧~

进入游戏行业两年多了，处于一边实践一边学习的状态，一开始身边没有牛人引导感觉确实浪费了一些时间。偶然在Gad上看到一个游戏开发入门系列的视频，觉得内容挺全面的，就定了一个月的计划把这些课程都看完了，收获不小，对游戏开发有了更为全面的认识。

如果你想进入游戏行业，觉得学习资料太多很难入门，那不妨先看看这个系列的视频。我对每个课程都做了笔记，如果课程中遇到了什么问题，随时可以向我提问。（也许你更倾向于问知乎上的各类大神~）

链接：

游戏开发入门系列（目录） - Jerish的博客 - CSDN博客
​blog.csdn.net/u012999985/article/details/79118198
看完这些，你应该对游戏开发有一个大致的了解（配合游戏引擎架构这本书效果更佳），算是踏入游戏行业一半了。然后，参考一下Milo大神给出的游戏开发必备的学习书单 ，按照你想深入的方向开始潜心修炼吧!

在这篇文章里，我试着概括性的对游戏开发做一个总结，希望让大家对游戏开发能有一个基本的认识，也欢迎各位提出意见和建议~

游戏开发基本功：

数学基础：根据你所做内容来决定，一般上层逻辑比较少的去考虑到积分等高数内容。但是如果想搞图形学，矩阵线性代数，高数必须要有一定的功底
算法：常见的排序，查找需要理解并掌握，进一步常见的还有分治，贪心，动态规划，有时候现学现卖也是可以的。另外，除了这些基本的算法，在游戏领域还是有很多其他领域不太常用的算法，比如八叉树查找，碰撞检测，A*。还有一些很特殊的情况需要开发者自己去寻找合适的算法。
C++（C#）：基本语法，代理，命名空间，const，继承，内存结构，虚表，引用，断言，宏定义等
数据结构：首先是掌握链表，数组，队列，堆，栈，图，树等数据结构，然后是各种排序，查找，遍历等算法。这些掌握了以后可以很快的熟悉stl或者类似的基本库原，用的时候可以更准确的选择合适的数据结构
设计模式：一般来说，我们需要设计模式来快速的搭建游戏逻辑框架，比如前面提到的各种逻辑系统。而且还需要通过设计模式来理解引擎各个模块的设计思路。当然，如果你想设计游戏引擎，那更不能少了设计模式了。
对引擎各个模块由一定深入的理解：这个不用多说，看一遍游戏引擎架构吧，不理解写出的代码经常会出现各种问题（比如同步问题），编辑器各种功能也用不好。
内存管理：可能很多引擎或者语言已经尽可能的帮你处理内存了，但是你难免需要在一些特殊情况下自己处理，内存池技术，各种C++的new的使用，不得不会。
对开发工具的熟悉：这里并不是指只是对某一个引擎使用熟练，而且对不同引擎相关的内容都有一定理解，可以很快的触类旁通。
编译原理，链接，第三方库：经常会遇到各种链接错误，编译错误，打包错误，这需要你有一定的相关知识与经验去解决这些问题。
性能分析与性能优化： 主要就是三个方面——内存，CPU，GPU。着手点有渲染批次，渲染实例化，布料优化，网络同步数据量，物理开销等，加载资源优化（包的合并），裁剪，声音文件加载，LOD，美术资源制作规范化等。调试的时候可以使用引擎内置工具，进一步的细节可以采用Intel的VTune工具（有时间我可能写一个相关的使用文档）

3.在执行效率上肯定多了一些开销，需要寻找函数地址

4.虚表的存在可能破坏一些封装安全，可以通过vptr绕过private的限制

参考书籍与资料：《C++ Primer》《The Design and Evolution of C++》（C++语言的设计与演化）



问：多继承的优缺点（提问概率：★★★）

好处：简单来讲就是为了实现多个基类特有的功能

缺点：菱形继承；二义性（可通过虚继承解决）

参考书籍与资料：《C++ Primer》《The Design and Evolution of C++》（C++语言的设计与演化）



问：为什么要用virtual destructor?为什么没有virtual constructor?（提问概率：★★★★）

问题一：

为了能正常调用子类的析构函数，否则会出现只调用基类析构函数而没有调用子类析构函数情况。（如果子类有指针成员且申请了堆空间，不调用子类调用析构函数就会造成内存泄漏）

class Base
{
public:
    virtual ~Base()
    {         
         cout<<"delete Base"<<endl;
    };
};

class Derive : public Base
{
  public:
    int* p;
    Derive()
    {
      p = new int;//构造时申请空间
    }
   ~Derive()
   {
       delete p;//析构时释放空间
       cout<<"delete Derive"<<endl;
   };
};

int main()
{
    Base *pbase = new Derive;
    delete pbase ;
    //如果析构函数不是virtual，就只会调用当前指针类型的析构函数（也就是基类Base的析构函数）。
    //反之，则会根据虚表找到派生类的析构函数并调用。
    //由于C++语言机制(或者说编译器会插入一些额外的代码)，调用完子类的析构函数后会自动调用基类的析构函数

    return 0;
}
问题二：

第一点，构造函数执行前，对象的内存信息都没有，vptr也没有初始化，如何找到虚函数表，实现虚调用。其次，需要理解虚函数的意义，他是为了实现多态，让子类去覆盖父类的操作，但是前提是你需要知道当前的类型是什么，而C++里面构造函数可以说决定了他的类型。另外，构造函数与析构函数的执行不同，他是从父类开始一步一步的构造成一个子类(即使父类没有构造函数也可能会被编译器合成一个)，所以你不能跳过父类的构造函数，子类的很多成员可能需要在父类的基础上去初始化。
不过，从设计的角度来考虑的话，虚构造的思想还是有意义的，和我们设计模式中的工厂模式有点类似，根据不同的类型去做不同的初始化。Delphi语言因为有一个祖先基类，所以可以做到虚构造，而C++从语言层面来讲不存在真正意义上的虚构造函数。

参考书籍与资料：《More Effective C++ 7.1》

构造函数不能是虚函数?

Delphi对象的产生和消亡过程 - findumars - 博客园

More C++ Idioms/Virtual Constructor



问：哪些函数不能是虚函数？

构造函数，上一个问题解释了。

static，虚函数为了实现多态需要通过this指针找到虚表，而static没有this指针。

inline，内联的话要看编译器，比较老的编译器可能不允许这样做，原因是内联过去的代码在编译时不清楚多态类型。不过目前的编译器已经可以对部分这样的情况作出优化，或者是拒绝内联。

友元函数，C++不支持友元函数的继承。



问：类的内存布局是什么样的？考虑有虚函数、多继承、虚继承几种情况。（提问概率：★★★★★）

简单总结一下就是类只有成员变量占用内存（静态成员不占类内部内存，函数不占内存）。如果有虚函数，每个类对象都会有一个虚函数指针Vptr（占用一个指针大小的内存），vptr指向一个虚函数表，表里面记录了各项标记virtual的函数，子类如果覆盖父类虚函数，对应虚表位置的虚函数会被子类的替换。如果是虚继承，还会有虚基类表记录当前对象相对虚基类的偏移，以及一个虚基类指针指向这个虚基类表。

虚表在编译完成时大小与布局就被决定了，加载时其内存位置也就被确定了。

1.单继承一个或多个类只有一个虚表一个虚指针
2.普通多继承会有基类的个数个虚表，基类的个数个虚指针。派生类自己独有的虚函数可能会放在第一个虚表的最后面
3.单个虚继承会有两个虚表（看情况）以及一个虚基类表，两个虚指针（这个可能与我们想象中的不一样，一个指向自己独有的虚函数的虚表，一个指向覆盖基类虚函数的虚表）以及一个虚基类指针与虚基类表 注意：如果派生类自己的虚函数与基类完全相同，可能只有一个虚表，一个虚指针
4.菱形多虚继承会有基类的个数个虚指针以及虚表（看情况，第3条有提到），有几个虚继承就有几个虚基类指针以及虚基类表
为了方便理解，转了几张图片https://www.cnblogs.com/demian/p/6538301.html（侵删）。不过，图片描述的不够详细，有一些情况没有考虑，可以的话建议看后面的代码示意。


单继承GrandChild——Child——Parent

多继承Derive——Base1；Derive——Base2；Derive——Base3 三个虚表，多余的虚函数会放到第一个虚表的后面

多继承菱形继承 D——B1 ；D——B2；B1——B；B2——B

多继承菱形虚继承D—— B1；D——B2；B1——B；B2——B
如果对对象的内存布局有疑问，可以自己写代码尝试。VS下面有命令可以方便的打印，/d1 reportSingleClassLayout+类名，/d1 reportAllClassLayout 放到项目属性的命令行里面，重新生成一下就会显示在控制台输出窗口里面，包括虚表结构。


class Base
{
public:
	int dataB;
	virtual void Get() {};
};

class B1 :virtual  public Base
{
public:
	int dataB1;
	virtual void GetB1() {};
};

class B2 :virtual  public Base
{
public:
	int dataB2;
	virtual void Get() {};
	virtual void GetB2() { dataB2++; };
};

class D : public B1, public B2
{
public:
	int dataD;
	virtual void GetD() {};
};

class B3 : public Base
{
public:
	int dataB3;
	virtual void GetB3() {};
};
//Vs打印的内存布局
class Base	size(8):
1>  	+---
1>   0	| {vfptr}
1>   4	| dataB
1>  	+---
1>
1>  Base::$vftable@:
1>  	| &Base_meta
1>  	|  0
1>   0	| &Base::Get
1>
1>  Base::Get this adjustor: 0
1>
1>  class B1	size(20):
1>  	+---
1>   0	| {vfptr}
1>   4	| {vbptr}
1>   8	| dataB1
1>  	+---
1>  	+--- (virtual base Base)
1>  12	| {vfptr}
1>  16	| dataB
1>  	+---
1>
1>  B1::$vftable@B1@:
1>  	| &B1_meta
1>  	|  0
1>   0	| &B1::GetB1
1>
1>  B1::$vbtable@:
1>   0	| -4
1>   1	| 8 (B1d(B1+4)Base)
1>
1>  B1::$vftable@Base@:
1>  	| -12
1>   0	| &Base::Get
1>
1>  B1::GetB1 this adjustor: 0
1>  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>              Base      12       4       4 0
1>
1>  class B2	size(20):
1>  	+---
1>   0	| {vfptr}
1>   4	| {vbptr}
1>   8	| dataB2
1>  	+---
1>  	+--- (virtual base Base)
1>  12	| {vfptr}
1>  16	| dataB
1>  	+---
1>
1>  B2::$vftable@B2@:
1>  	| &B2_meta
1>  	|  0
1>   0	| &B2::GetB2
1>
1>  B2::$vbtable@:
1>   0	| -4
1>   1	| 8 (B2d(B2+4)Base)
1>
1>  B2::$vftable@Base@:
1>  	| -12
1>   0	| &B2::Get
1>
1>  B2::Get this adjustor: 12
1>  B2::GetB2 this adjustor: 0
1>  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>              Base      12       4       4 0
1>
1>  class D	size(36):
1>  	+---
1>   0	| +--- (base class B1)
1>   0	| | {vfptr}
1>   4	| | {vbptr}
1>   8	| | dataB1
1>  	| +---
1>  12	| +--- (base class B2)
1>  12	| | {vfptr}
1>  16	| | {vbptr}
1>  20	| | dataB2
1>  	| +---
1>  24	| dataD
1>  	+---
1>  	+--- (virtual base Base)
1>  28	| {vfptr}
1>  32	| dataB
1>  	+---
1>
1>  D::$vftable@B1@:
1>  	| &D_meta
1>  	|  0
1>   0	| &B1::GetB1
1>   1	| &D::GetD
1>
1>  D::$vftable@B2@:
1>  	| -12
1>   0	| &B2::GetB2
1>
1>  D::$vbtable@B1@:
1>   0	| -4
1>   1	| 24 (Dd(B1+4)Base)
1>
1>  D::$vbtable@B2@:
1>   0	| -4
1>   1	| 12 (Dd(B2+4)Base)
1>
1>  D::$vftable@Base@:
1>  	| -28
1>   0	| &thunk: this-=4; goto B2::Get
1>
1>  D::GetD this adjustor: 0
1>  vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>              Base      28       4       4 0
1>
1>  class B3	size(12):
1>  	+---
1>   0	| +--- (base class Base)
1>   0	| | {vfptr}
1>   4	| | dataB
1>  	| +---
1>   8	| dataB3
1>  	+---
1>
1>  B3::$vftable@:
1>  	| &B3_meta
1>  	|  0
1>   0	| &Base::Get
1>   1	| &B3::GetB3
1>
1>  B3::GetB3 this adjustor: 0
另外，sizeof（）可以计算一个出一个类对象的大小，大小一般是类中的所有成员的sizeof()大小之和，其实就是遵循上面提到的内存布局

参考书籍与资料：《The Design and Evolution of C++》（C++语言的设计与演化）《Inside the C++ Object Model》（深度探索C++对象模型）

虚继承及继承的内存布局





问：dynamic_cast是怎么实现的（提问概率：★★★★）

dynamic_cast属于RTTI,运行时类型识别的一个内容，他是c++realise1.0的主要扩充功能之一。主要内容是typeid与typeinfo的实现,基本思路就是在有虚函数的类的虚表的头部位置存放RTTI的相关信息。在VC里面可以看到是一个叫做RTTI Complete Object Locator的结构体里面存放相关的信息。在强转的时候，会读取里面对应的类的信息进而判断是否能转换成功。


参考书籍与资料：《The Design and Evolution of C++》（C++语言的设计与演化）

c _rtti机制深度剖析

Classes, Methodsand RTTI

Visual C++ RTTI Inspection



C++内存管理相关


问：C++内存模型是什么？如何理解自由存储区与堆的区别？（提问概率：★★★★）

